FirstRoutesAndController/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "name_7"], ["email", "email_7"], ["updated_at", "2022-12-15 15:13:24.559074"], ["id", 7]]
---
    def update
        @user = User.find(params[:id])

        if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
    def destroy
        @user = User.find(params[:id])
        render json: @user.delete